In [ ]:
#Write dataframe into CSV file
import pandas as pd
df=pd.DataFrame({'S.No.':[1,2,3,4],'Name':['Tom','Lee','Steven','Ram'],
                 'Age':[28,32,43,38],'City':['Toronto','Hongkong','Bay Area','Hyderabad'],
                 'Salary':[20000,3000,8300,3900]})
print(df)
df.to_csv('temp.csv',index = False)

   S.No.    Name  Age       City  Salary
0      1     Tom   28    Toronto   20000
1      2     Lee   32   Hongkong    3000
2      3  Steven   43   Bay Area    8300
3      4     Ram   38  Hyderabad    3900

# New Section

In [ ]:
# Read data from the CSV file
df1=pd.read_csv('temp.csv')
print(df1)
print(df1.dtypes)

   S.No.    Name  Age       City  Salary
0      1     Tom   28    Toronto   20000
1      2     Lee   32   Hongkong    3000
2      3  Steven   43   Bay Area    8300
3      4     Ram   38  Hyderabad    3900
S.No.      int64
Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [ ]:
#custom Index
df1=pd.read_csv('temp.csv',index_col=['S.No.'])
print(df1)

         Name  Age       City  Salary
S.No.
1         Tom   28    Toronto   20000
2         Lee   32   Hongkong    3000
3      Steven   43   Bay Area    8300
4         Ram   38  Hyderabad    3900

In [ ]:
#Converters
import numpy as np
df = pd.read_csv("temp.csv", dtype={'Salary': np.float64})
print(df.dtypes)

S.No.       int64
Name       object
Age         int64
City       object
Salary    float64
dtype: object

In [ ]:
#header_names
df=pd.read_csv("temp.csv", names=['a', 'b', 'c','d','e'])
print(df)

       a       b    c          d       e
0  S.No.    Name  Age       City  Salary
1      1     Tom   28    Toronto   20000
2      2     Lee   32   Hongkong    3000
3      3  Steven   43   Bay Area    8300
4      4     Ram   38  Hyderabad    3900

In [ ]:
df=pd.read_csv("temp.csv",names=['a','b','c','d','e'],header=0)
print(df)

   a       b   c          d      e
0  1     Tom  28    Toronto  20000
1  2     Lee  32   Hongkong   3000
2  3  Steven  43   Bay Area   8300
3  4     Ram  38  Hyderabad   3900

In [ ]:
#skiprows
df=pd.read_csv("temp.csv", skiprows=1)
print(df)

   1     Tom  28    Toronto  20000
0  2     Lee  32   Hongkong   3000
1  3  Steven  43   Bay Area   8300
2  4     Ram  38  Hyderabad   3900

In [ ]:
import pandas as pd
url = 'http://bit.ly/2cLzoxH'
tips=pd.read_csv(url)
print (tips.head(10))

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106
5  Afghanistan  1977  14880372.0      Asia   38.438  786.113360
6  Afghanistan  1982  12881816.0      Asia   39.854  978.011439
7  Afghanistan  1987  13867957.0      Asia   40.822  852.395945
8  Afghanistan  1992  16317921.0      Asia   41.674  649.341395
9  Afghanistan  1997  22227415.0      Asia   41.763  635.341351

In [ ]:
#Column Selection
tips=pd.read_csv(url)
print(tips[['country', 'year', 'pop', 'continent']].head(5))

       country  year         pop continent
0  Afghanistan  1952   8425333.0      Asia
1  Afghanistan  1957   9240934.0      Asia
2  Afghanistan  1962  10267083.0      Asia
3  Afghanistan  1967  11537966.0      Asia
4  Afghanistan  1972  13079460.0      Asia

In [ ]:
#Filtering
print(tips[tips['continent'] == 'Europe'].head(5))

    country  year        pop continent  lifeExp    gdpPercap
12  Albania  1952  1282697.0    Europe    55.23  1601.056136
13  Albania  1957  1476505.0    Europe    59.28  1942.284244
14  Albania  1962  1728137.0    Europe    64.82  2312.888958
15  Albania  1967  1984060.0    Europe    66.22  2760.196931
16  Albania  1972  2263554.0    Europe    67.69  3313.422188

In [ ]:
#Group By
print(tips.groupby('continent').size())

continent
Africa      624
Americas    300
Asia        396
Europe      360
Oceania      24
dtype: int64

In [ ]:
print(tips[tips['continent'] == 'Europe'].tail(5))

             country  year         pop continent  lifeExp    gdpPercap
1603  United Kingdom  1987  56981620.0    Europe   75.007  21664.78767
1604  United Kingdom  1992  57866349.0    Europe   76.420  22705.09254
1605  United Kingdom  1997  58808266.0    Europe   77.218  26074.53136
1606  United Kingdom  2002  59912431.0    Europe   78.471  29478.99919
1607  United Kingdom  2007  60776238.0    Europe   79.425  33203.26128

In [ ]:
# excel file
tips.to_excel("tips.xlsx", sheet_name='customer',index=False)

In [ ]:
#Rear data from excel file
tips = pd.read_excel("tips.xlsx", sheet_name='customer')
print (tips.head())

   Unnamed: 0      country  year         pop continent  lifeExp   gdpPercap
0           0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1           1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2           2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3           3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4           4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106